document.getElementById('header1').addEventListener('click', function() {
    document.getElementById('textFrame').innerText = 'Тема: СТРУКТУРА HTML-ДОКУМЕНТА. ВИБІР ПРЕДМЕТНОЇ ГАЛУЗІ. РОБОТА З ПОСИЛАННЯМИ, ТАБЛИЦЯМИ, ЗОБРАЖЕННЯМИ, СПИСКАМИ в HTML-ДОКУМЕНТІ.\n' +
    '\n Мета: придбати практичні навички роботи з HTML-документом, таблицями,\n' +
    'зображеннями, посиланнями, списками, формами.\n' +
    'Створити шаблон звітного HTML-документом для відображення\n' +
    'результатів роботи всіх лабораторних робіт.';
});
document.getElementById('header2').addEventListener('click', function() {
    document.getElementById('textFrame').innerText = 'Опис предметного середовища:\n\n' +
    'Наш майбутній веб-додаток - це фронтенд сайт блогу. Він призначений для публікації та відображення інформації у вигляді статей, новин або записів блогу. Користувачі зможуть переглядати вміст блогу, читати статті, переглядати коментарі та взаємодіяти з інтерфейсом сайту.\n\n' +
    'Функціональні вимоги:\n\n' +
    '- Відображення статей: Сайт повинен дозволяти відображати список статей з заголовками та короткими описами на головній сторінці.\n' +
    '- Перегляд повної статті: Користувачі повинні мати можливість відкривати статті повністю для читання, переглядати вміст, включаючи текст, зображення та інші мультимедійні елементи.\n' +
    '- Пошук: Користувачі повинні мати можливість здійснювати пошук статей за ключовими словами або категоріями.\n\n' +
    'Нефункціональні вимоги:\n\n' +
    '- Зовнішній вигляд та користувацький інтерфейс: Сайт повинен мати привабливий дизайн, легку навігацію та зручний користувацький інтерфейс.\n' +
    '- Адаптивність: Веб-додаток повинен бути реактивним і коректно відображатися на різних пристроях і екранах, включаючи мобільні пристрої та планшети.\n' +
    '- Продуктивність: Сайт повинен швидко завантажуватися і забезпечувати швидку навігацію між сторінками та статтями.';
});
document.getElementById('header3').addEventListener('click', function() {
    document.getElementById('textFrame').innerText = 'Header 3 clicked';
});
document.getElementById('header4').addEventListener('click', function() {
    document.getElementById('textFrame').innerText = 'Header 4 clicked';
});
